SRC/boundaryCondtions/parabolicVelocity/testCase/pitzDailyParabolicInlet/system/streamlines
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out files of streamlines with interpolated field data in VTK format.

\*---------------------------------------------------------------------------*/

direction       both;

seedSampleSet
{
    type            lineUniform;
    start           (-0.0205 0.001  0.00001);
    end             (-0.0205 0.0251 0.00001);
    nPoints         10;
    axis            x;
}

fields          (p k U);

#includeEtc "caseDicts/postProcessing/visualization/streamlines.cfg"

// ************************************************************************* //
